content/posts/top.md
+++
title = "Top"
author = ["Joe Corneli"]
lastmod = 2020-09-12T21:07:50+01:00
slug = "top"
draft = false
+++

## Representative Prior Work {#representative-prior-work}


### PlanetMath {#planetmath}

In our work on PlanetMath we came up with several previews.  Some of
these may be concretely relevant.

-   <https://github.com/holtzermann17/planetmath-docs/labels/PREVIEW>
-   We wondered if there could be a specific opportunity with the
    category theory community.


### Modelling the way mathematics is actually done {#modelling-the-way-mathematics-is-actually-done}

In this paper we talked about how mathematics is situated somewhere in
between games and storytelling in its complexity.


## We aim for short correlated sprints as opposed to random behaviour {#we-aim-for-short-correlated-sprints-as-opposed-to-random-behaviour}

“Two people working together 4 hours a week for two weeks” is an
approximate unit of work.  Once we have amassed a few outputs from
this kind of effort, we will have some evidence of the kinds of things
that we can realistically achieve.


## Customer development {#customer-development}

“Users” and “customers” will come from expanding our little community.

> Zans: _If I implemented as I read things, it would be a pretty interesting blog. There could be a huge market of people interested in following this, this would give a pool of people who know who we are. This is a nice goal b/c it doesn't focus on the product... but it's a deliverable, made up of smaller deliverables, and a concrete benefit._


## Us {#us}

So, let's have a blog, and say, roughly speaking we will try to
develop a curriculum through the blog.  This gives us a starting point
in terms of resources.  People might interject in ways that aren't
exactly a curriculum.  But we would later see how things can be
ordered.

-   Rouseau: _amour-propre_ / _amor du sois_
-   Record discussions, post on a YouTube channel
-   Try to record and share conversations, but don't constrain things to come out in a purely structured curriculum.

> Hypothetical conversation: _In my next post I want to integrate something that I learned from you about PL.  I want to drive in the direction of synthesis, as hard as I know how to right now.  This depends on everyone having free time to invest in this.  Start a blog where we think about what's the overlap in terms of learning?_


## A quandry {#a-quandry}

Note that hand-coding of a curriculum vs making a general framework
that anyone can contribute to (e.g., to make their own curricula) are
pretty different things.  We will sort out this ambiguity later.


## Subgoals: {#subgoals}

-   [Construct, critique, improve models]({{< relref "construct_critique_improve_models" >}})
-   [Underlying foundation]({{< relref "underlying_foundation" >}})
-   [Why not what]({{< relref "why_not_what" >}})
-   [For the sake of advancing AI]({{< relref "for_the_sake_of_advancing_ai" >}})
-   [Technical experiments become easier]({{< relref "technical_experiments_become_easier" >}})
-   [Which model construction process works as a whole?]({{< relref "which_model_construction_process_works_as_a_whole" >}})
